aides/DIAGRAMME_CAS_UTILISATION.puml
@startuml
left to right direction
skinparam packageStyle rectangle
skinparam shadowing false
skinparam actorStyle awesome

actor Administrateur as Admin
actor "Médecin" as Medecin
actor Patient

rectangle "Application web de suivi hospitalier" {
  usecase "S'authentifier" as UC1
  usecase "Gérer les comptes\nde connexion" as UC2
  usecase "Gérer les profils" as UC3
  usecase "Gérer les utilisateurs" as UC4
  usecase "Gérer les patients" as UC5
  usecase "Créer un dossier\npatient" as UC6
  usecase "Consulter un dossier\npatient" as UC7
  usecase "Modifier l'état\nde la greffe" as UC8
  usecase "Ajouter une greffe" as UC9
  usecase "Consulter ses\ninformations personnelles" as UC10
  usecase "Consulter son\ndossier médical" as UC11
  usecase "Consulter les\nnotes médicales" as UC12
  usecase "Consulter l'historique\ndes greffes" as UC13
}

Admin -- UC1
Admin -- UC2
Admin -- UC3
Admin -- UC4
Admin -- UC5

Medecin -- UC1
Medecin -- UC5
Medecin -- UC6
Medecin -- UC7
Medecin -- UC8
Medecin -- UC9

Patient -- UC1
Patient -- UC10
Patient -- UC11
Patient -- UC12
Patient -- UC13

@enduml
